#
# Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
#   - Выведите значение переменной name на экран.
#   - Создайте переменную age и присвойте ей значение вашего возраст (целое число).
#   - Выведите значение переменной age на экран.
#   - Измените значение переменной age на новое значение (например, на age + 1).
#   - Выведите измененное значение переменной age на экран.
#   - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#   - Выведите значение переменной is_student на экран.

name = "SERGEY"             # STRING
print("--->>> 1: ", name)
age = 46                    # INTEGER
print("--->>> 2: ", age)
print("--->>> 2A: ", age + 1)
is_student = True
print("--->>> 1: ", is_student)
# print("--->>> 1: ", name)
