# Создайте переменные и выполните операции:
#   - Создайте переменную num1 и присвойте ей значение 5.
#   - Создайте переменную num2 и присвойте ей значение 3.
#   - Создайте переменную sum и присвойте ей сумму num1 и num2.
#   - Выведите значение переменной sum на экран.
#   - Создайте переменную result и присвойте ей результат выражения sum + num1 * num2 .
#   - Выведите значение переменной result на экран.

var_1 = 5        # input()
var_2 = 3        # input()
num_1 = var_1
num_2 = var_2
u_sum = num_1 + num_2
u_result = u_sum + num_1 * num_2
print('Сумма', u_sum)
print("Результат", u_result)
